#materials table
stal_45 = "Сталь 45"
stal_50 = "Сталь 50Г"
stal_40X = "Сталь 40Х"
stal_40XH = "Сталь 40ХН"
stal_20X = "Сталь 20Х"
stal_30XGT = "Сталь 30ХГТ"
chug = "Чугун ВЧ"
textolit = "Текстолит"
dsp = "ДСП"
poly = "Полиамид"


materials_dict = {
    stal_45: [1.5, 600],
    stal_50: [6, 800],
    stal_40X: [2.5, 650],
    stal_40XH: [10, 1000],
    stal_20X: [12, 1100],
    stal_30XGT: [12, 1100],
    chug: [1, 600],
    textolit: [0.06, 50],
    dsp: [0.06, 50],
    poly: [0.06, 40]
}

#types table
types_dict = {
    "Сталь-сталь": 495,
    "Сталь-чугун": 445,
    "Сталь-бронза": 430,
    "Чугун-чугун": 415,
    "Текстолит-сталь": 200,
    "ДСП-сталь": 225,
    "Полиамид-сталь": 155
}

